2023-11/smartsim/codedSmartRedisFunctionObject/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs ("libcodedRedisFunctionObject.so");

functions
{
    #includeFunc streamlines

    smartRedis
    {
        type coded;
        libs (codedRedisFunctionObject);

        name redisAI;
        clusterMode off;
        codeWrite #{
            Info << "------ BEGIN codeWrite ------" << endl;
            sendField<volScalarField>("p");
            sendField<volVectorField>("U");
            Info << "------ END   code Write -----" << endl;
        #};
    }
}

// ************************************************************************* //
